README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>esy</title>
<!-- 2016-08-05 Пт 17:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Oleg Shalaev" />
</head>
<body>
<div id="content">
<h1 class="title">esy</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Motivation</a></li>
<li><a href="#sec-2">2. Quick start</a></li>
<li><a href="#sec-3">3. Resulting files</a></li>
<li><a href="#sec-4">4. Usage</a></li>
</ul>
</div>
</div>
<p>
Note: this program requires <a href="https://github.com/chalaev/cl-libconfig">cl-libconfig</a> (lisp interface to the standard libconfig library).
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
Though I use free cloud file storages (<a href="https://disk.yandex.com/">yandex-disk</a> and <a href="https://cloud.mail.ru/">mail.ru-cloud</a> have official linux
clients), I do not trust them. I am afraid that files there are easily accessible to FSB (former
KGB) or NSA officers, and may end up in hands of criminals. I do not want anyone even to know the
names of my files and directories. This is why my cloud-stored files are collected in archives
and encrypted.
</p>

<p>
However, encryption is inconvenient if I want to share (with a daily syncronization) folders
between different computers. For example, I use three computers: office workstation, laptop, and
home server. It is very unprobable that all of them will be broken simultaneously, so
my files are secure if syncronized among all three.
</p>

<p>
Only important files are syncronized. The importance can be encoded in the
(libconfig-compatible) configuration file (see example.conf) according to name, group, and size of a
file. Group names are preserved so it is ok if they have different IDs on different
hosts. Permissions are preserved as well. If a file (or a directory) is renamed/moved/erased/chmod-ed
on one host, the same will hapen on the other ones.
Note however that an independent backup is necessary
(I use <code>backup2l</code> + <code>gpg</code> + <code>yandex-disk</code> to protect important data from accidental removal.)
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Quick start</h2>
<div class="outline-text-2" id="text-2">
<p>
Copy all files from the <a href="https://github.com/chalaev/esy">github archive</a> to some directory, say <code>~/esy-source/</code>:
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir ~/esy-source ~/.esy
<span style="color: #483d8b;">cd</span> ~/esy-source
git clone https://github.com/chalaev/esy
<span style="color: #483d8b;">cd</span> esy
sed -e <span style="color: #8b2252;">"s/myhostname/`hostname`/"</span> -e <span style="color: #8b2252;">"s,/home/user,$HOME,"</span> example.conf &gt;  ~/.esy/<span style="color: #ff00ff;">`hostname`</span>.conf
mkdir -p ~/esy-test/{mail,2,3,4}
mkdir -p ~/esy-test/2/a/b/c
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"aaa"</span> &gt; ~/esy-test/2/a/b/1.txt
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"bbb"</span> &gt; ~/esy-test/3/2.txt
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"ccc"</span> &gt; ~/esy-test/3/c.txt
mkdir ~/esy-test/mail/a
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"uuu"</span> &gt; ~/esy-test/mail/a/u.txt
~/local/bin/sbcl --load main.lisp
</pre>
</div>
<p>
where <code>~/local/bin/sbcl</code> is the (common) lisp command.<br  />
The default configuration file <code>~/.esy/`hostname`.conf</code> tells esy to
(recursively) monitor changes in the directories <code>~/esy-test/{mail,2,3,4,5}</code>.<br  />
The program will refuse to monitor inexisting <code>~/esy-test/5</code><br  />
It is instructive to monitor the log file:
</p>
<div class="org-src-container">

<pre class="src src-sh">tail -f ~/.esy/log.txt
</pre>
</div>
<p>
Now let us (in another terminal window)
create/move/copy/chmod files and directories in the monitored directories, for example:
</p>
<div class="org-src-container">

<pre class="src src-sh">chmod a+r ~/esy-test/3/2.txt
mv ~/esy-test/2/a/b/1.txt ~/esy-test/1/
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"ddd"</span> &gt;&gt; ~/esy-test/3/c.txt
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"eee"</span> &gt;&gt; ~/esy-test/3/e.txt
mv ~/esy-test/3/e.txt ~/esy-test/4/
rm -r ~/esy-test/mail/a
</pre>
</div>
<p>
File-manipulation events are logged into <code>~/.esy/log.txt</code>
   For now the (most informative) <code>logLevel=0</code> in <code>example.conf</code> is set, but if you think that
   <code>~/.esy/log.txt</code> is growing too fast, set <code>logLevel=2</code> or even <code>logLevel=4</code>.
Now stop the program:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"quit"</span> &gt; ~/.esy/message.ctl
mkdir ~/.esy/do-read.ctl
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Resulting files</h2>
<div class="outline-text-2" id="text-3">
<p>
Let us consider simple live example of playing in the <code>~/esy-test/</code> directory on host named "theorie13":
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #483d8b;">cd</span> ~/esy-test/1
<span style="color: #483d8b;">echo</span> aa &gt;&gt; nd/22.txt 
mv gg nd/
<span style="color: #483d8b;">cd</span> ~/esy-test/3
mkdir ttt
mv ff.txt ttt/
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"quit"</span> &gt; ~/.esy/message.ctl
mkdir ~/.esy/do-read.ctl
</pre>
</div>
<p>
The resulting <code>~/.esy/local.sh</code> is
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">sh</span><span style="color: #b22222;"> -e</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">generated 2016-08-04 17:47:25 GMT-4 by esy on "theorie13"</span>
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"`date '+%Y-%m-%d %H:%M:%S'` @ `hostname` = `hostname -I`"</span> &gt; ~/.esy/host-id.dat
timeout 5 emacsclient -e <span style="color: #8b2252;">"(save-some-buffers t)"</span>
fetchmail --quit
<span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"/home/shalaev/esy-test/"</span>
tar jcfv ~/.esy/$(<span style="color: #ff00ff;">hostname</span>).tbz ~/.esy/host-id.dat <span style="color: #8b2252;">"/home/shalaev/.esy/from-theorie13.sh"</span> <span style="color: #8b2252;">"1/nd/22.txt"</span>
rm ~/.esy/host-id.dat
<span style="color: #b22222;"># </span><span style="color: #b22222;">end</span>
<span style="color: #483d8b;">cd</span> -
</pre>
</div>
<p>
The resulting <code>~/.esy/from-theorie13.sh</code> is
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">sh</span><span style="color: #b22222;"> -e</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">generated 2016-08-04 17:47:25 GMT-4 by esy on "theorie13"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">To be excecuted on remote host</span>

<span style="color: #a020f0;">case</span>  <span style="color: #ff00ff;">`hostname`</span>  <span style="color: #a020f0;">in</span>
<span style="color: #8b2252;">"mendeleev"</span>)
<span style="color: #a0522d;">rootDir</span>=<span style="color: #8b2252;">"/home/shalaev/tmp/esy-test/"</span>
;;
*)
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"this host was not allowed in theorie13:.esy/theorie13.conf, I refuse to change files here, stopping"</span>
<span style="color: #a020f0;">exit</span>
;;
<span style="color: #a020f0;">esac</span>
tar xjfv ~/.esy/from-theorie13.tbz -C $<span style="color: #a0522d;">rootDir</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">moving directories:</span>
mv -i <span style="color: #8b2252;">"1/gg/"</span> <span style="color: #8b2252;">"1/nd/gg/"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">moving files:</span>
mv -i <span style="color: #8b2252;">"3/ff.txt"</span> <span style="color: #8b2252;">"3/ttt/ff.txt"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">deleting files an directories:</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">adjusting ownership (GIDs might be different on different hosts):</span>
chgrp shalaev <span style="color: #8b2252;">"3/ttt/"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">adjusting dates:</span>
touch -d <span style="color: #8b2252;">"2016-08-04 17:47:10 GMT-4"</span> <span style="color: #8b2252;">"3/ttt/"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">adjusting permissions:</span>
chmod 770 <span style="color: #8b2252;">"3/ttt/"</span>
<span style="color: #483d8b;">cd</span> -
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Usage</h2>
<div class="outline-text-2" id="text-4">
<p>
The simplest way to use these files is off-line one.
I work on theorie13 in my office with esy monitoring all files I change.
At the end of the day, I 
run <code>~/.esy/local.sh</code> and
copy <code>~/.esy/from-theorie13.sh</code> and <code>~/.esy/theorie13.tbz</code> to a usb drive.
At home I 
</p>
<div class="org-src-container">

<pre class="src src-sh">mv from-theorie13.sh theorie13.tbz ~/.esy
<span style="color: #483d8b;">cd</span> ~/.esy
chmod +x from-theorie13.sh
./from-theorie13.sh
</pre>
</div>
<p>
and then launch esy in order to save any home file-edits on my work computer.
</p>

<p>
In reality I use email to copy files between hosts (I have special gmail accounts for that):
the file <code>~/.procmailrc</code> can be instructed to automatically save attachments from emails arriving from a certain address to <code>~/.esy/</code> …
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Oleg Shalaev</p>
<p class="date">Created: 2016-08-05 Пт 17:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
